cask_args appdir: '~/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'buo/cask-upgrade'
brew 'mas'

brew 'gh'
brew 'gpg'
brew 'coreutils'
brew 'gnu-sed'
brew 'pass'
brew 'pinentry-mac'
brew 'wireguard-tools'

cask 'netnewswire'
cask 'vlc'
cask 'iterm2'
cask 'visual-studio-code'

# Shared across machine users

cask 'maintenance', args: { appdir: '/Applications' }
cask 'brave-browser', args: { appdir: '/Applications' }
cask 'transmission', args: { appdir: '/Applications' }

brew 'nvm'
brew 'yarn'
brew 'watchman'

cask 'android-sdk'
cask 'android-file-transfer'
cask 'android-ndk'
cask 'android-platform-tools'
cask 'android-studio'
brew 'gradle'
cask 'intel-haxm'
cask 'temurin11'
mas 'Xcode', id: 497799835
