cask_args appdir: '~/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'buo/cask-upgrade'
tap 'homebrew/autoupdate'
brew 'mas'

brew 'gh'
brew 'gpg'
brew 'coreutils'
brew 'gnu-sed'
cask 'bitwarden'
brew 'pinentry-mac'

cask 'netnewswire'
cask 'jellyfin-media-player'
cask 'visual-studio-code'

# Shared across machine users

cask 'maintenance', args: { appdir: '/Applications' }
cask 'google-chrome', args: { appdir: '/Applications' }
cask 'iterm2', args: { appdir: '/Applications' }

tap 'jorgelbg/tap'
brew 'pinentry-touchid'

mas 'AdGuard for Safari', id: 1440147259
