cask_args appdir: '~/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'buo/cask-upgrade'
tap 'homebrew/autoupdate'
brew 'mas'

brew 'gh'
brew 'gpg'
brew 'coreutils'
brew 'gnu-sed'
brew 'pinentry-mac'

cask 'jellyfin-media-player'
cask 'visual-studio-code'
cask 'maintenance'
cask 'google-chrome'
cask 'iterm2'

tap 'jorgelbg/tap'
brew 'pinentry-touchid'

mas 'AdGuard for Safari', id: 1440147259
mas 'Bitwarden', id: 1352778147
mas 'WireGuard', id: 1451685025
